## 구조화 데이터
#### 데이터프레임(DataFrame)
###### 행 선택 (Entry, Record, Row) -> loc, iloc

In [1]:
# 모듈 로딩
import pandas as pd

In [2]:
# DataFrame() 함수로 데이터프레임 변환. 변수 df에 저장
exam_data={'수학':[90, 80, 70], '영어':[98, 89, 95], '음악':[85, 95, 100], '체육':[100, 90, 90]}

In [3]:
df=pd.DataFrame(exam_data, index=['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [5]:
df.loc['서준']

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [6]:
df.iloc[0]

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [7]:
df.loc[['서준','우현']]

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [8]:
df.iloc[[0, 1]]

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [9]:
df.loc['서준':'우현']

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [10]:
df.iloc[0:1]

    수학  영어  음악   체육
서준  90  98  85  100

###### 열 선택
    * DataFrame객체 ["열 이름"]
    * DataFrame객체.열이름

In [11]:
df['수학']

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [12]:
type(df['수학'])

pandas.core.series.Series

In [16]:
# '영어'점수 데이터만 선택. 변수 english에 저장
english=df.영어
english

서준    98
우현    89
인아    95
Name: 영어, dtype: int64

In [17]:
music_gym=df[['음악','체육']]
music_gym

     음악   체육
서준   85  100
우현   95   90
인아  100   90

In [18]:
math2=df[['수학']]
math2

    수학
서준  90
우현  80
인아  70

- 원소 선택
    * DataFrame객체.loc[행이름,열이름]
    * DataFrame객체.iloc[행번호,열번호]

In [23]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [20]:
df.loc['서준','음악']

85

In [21]:
df.iloc[0,2]

85

In [22]:
df.loc['서준',['음악','체육']]

음악     85
체육    100
Name: 서준, dtype: int64

In [24]:
df.iloc[0,[2,3]]

음악     85
체육    100
Name: 서준, dtype: int64

In [25]:
df.loc['서준','음악':'체육']

음악     85
체육    100
Name: 서준, dtype: int64

In [26]:
df.iloc[0, 2:]

음악     85
체육    100
Name: 서준, dtype: int64

In [27]:
# df의 2개 이상의 행과 열로부터 원소 선택 ('서준', '우현'의 '음악', '체육' 점수)
df.loc[['서준','우현'],['음악','체육']]

    음악   체육
서준  85  100
우현  95   90

In [28]:
df.iloc[[0,1],[2,3]]

    음악   체육
서준  85  100
우현  95   90

In [29]:
df.loc['서준':'우현', '음악':'체육']

    음악   체육
서준  85  100
우현  95   90

In [30]:
df.iloc[0:2, 2:]

    음악   체육
서준  85  100
우현  95   90